Stibax/Arduino.esp8266-weather-clock-opensource/firmware/web_server.cpp
  config.night_mode_enabled = server.hasArg("night_mode_enabled");
  if (server.hasArg("night_start_hour")) {
    config.night_start_hour = server.arg("night_start_hour").toInt();
  }
  if (server.hasArg("night_start_minute")) {
    config.night_start_minute = server.arg("night_start_minute").toInt();
  }
  if (server.hasArg("night_end_hour")) {
    config.night_end_hour = server.arg("night_end_hour").toInt();
  }
  if (server.hasArg("night_end_minute")) {
    config.night_end_minute = server.arg("night_end_minute").toInt();
  }
  config.night_start_hour = constrain(config.night_start_hour, 0, 23);
  config.night_start_minute = constrain(config.night_start_minute, 0, 59);
  config.night_end_hour = constrain(config.night_end_hour, 0, 23);
  config.night_end_minute = constrain(config.night_end_minute, 0, 59);

  if (server.hasArg("admin_username")) {
    safeStringCopy(server.arg("admin_username"), config.admin_username, sizeof(config.admin_username));
  }
  if (server.hasArg("admin_password")) {
    safeStringCopy(server.arg("admin_password"), config.admin_password, sizeof(config.admin_password));
  }

  saveConfig();

  String html = F("<!DOCTYPE html><html><head>");
  html += F("<meta charset='UTF-8'>");
  html += F("<meta http-equiv='refresh' content='5;url=/'>");
  html += F("<style>body{font-family:Arial;text-align:center;margin-top:50px;}</style>");
  html += F("</head><body>");
  html += F("<h1>Configuration Saved!</h1>");
  html += F("<p>Device will reboot in 5 seconds...</p>");
  html += F("</body></html>");

  server.send(200, "text/html", html);

  delay(1000);
  ESP.restart();
}

void ICACHE_FLASH_ATTR handleAPITime() {
  String json = "{";
  json += "\"time\":\"" + timeClient.getFormattedTime() + "\",";
  json += "\"hours\":" + String(timeClient.getHours()) + ",";
  json += "\"minutes\":" + String(timeClient.getMinutes()) + ",";
  json += "\"seconds\":" + String(timeClient.getSeconds()) + ",";
  json += "\"epoch\":" + String(timeClient.getEpochTime());
  json += "}";

  server.send(200, "application/json", json);
}

void ICACHE_FLASH_ATTR handleAPIStatus() {
  String json = "{";
  json += "\"wifi\":{";
  json += "\"ssid\":\"" + String(WiFi.SSID()) + "\",";
  json += "\"ip\":\"" + WiFi.localIP().toString() + "\",";
  json += "\"rssi\":" + String(WiFi.RSSI()) + ",";
  json += "\"hostname\":\"" + String(config.hostname) + "\"";
  json += "},";
  json += "\"time\":{";
  json += "\"current\":\"" + timeClient.getFormattedTime() + "\",";
  json += "\"timezone_offset\":" + String(config.timezone_offset) + ",";
  json += "\"ntp_synced\":" + String(timeClient.isTimeSet() ? "true" : "false");
  json += "},";
  json += "\"system\":{";
  json += "\"uptime\":" + String(millis() / 1000) + ",";
  json += "\"free_heap\":" + String(ESP.getFreeHeap()) + ",";
  json += "\"chip_id\":\"" + String(ESP.getChipId(), HEX) + "\"";
  json += "}";
  json += "}";

  server.send(200, "application/json", json);
}

void ICACHE_FLASH_ATTR handleAPIDebug() {
  String json = "{";
  json += "\"internet_connected\":" + String(internetConnected ? "true" : "false") + ",";
  json += "\"ntp_attempts\":" + String(ntpAttempts) + ",";
  json += "\"ntp_successes\":" + String(ntpSuccesses) + ",";
  json += "\"last_error\":\"" + lastError + "\",";
  json += "\"gateway\":\"" + WiFi.gatewayIP().toString() + "\",";
  json += "\"dns\":\"" + WiFi.dnsIP().toString() + "\"";
  json += "}";

  server.send(200, "application/json", json);
}

void ICACHE_FLASH_ATTR handleAPIWeather() {
  String json = "{";
  json += "\"enabled\":" + String(config.weather_enabled ? "true" : "false") + ",";
  json += "\"valid\":" + String(weather.valid ? "true" : "false") + ",";
  json += "\"temperature\":" + String(weather.temperature, 1) + ",";
  json += "\"weathercode\":" + String(weather.weathercode) + ",";
  json += "\"windspeed\":" + String(weather.windspeed, 1) + ",";
  json += "\"last_update\":" + String(weather.lastUpdate) + ",";
  json += "\"sunrise\":\"" + String(sunTimes.sunrise) + "\",";
  json += "\"sunset\":\"" + String(sunTimes.sunset) + "\",";
  json += "\"sunrise_minutes\":" + String(sunTimes.sunriseMinutes) + ",";
  json += "\"sunset_minutes\":" + String(sunTimes.sunsetMinutes);
  json += "}";

  server.send(200, "application/json", json);
}

void ICACHE_FLASH_ATTR handleAPIConfigExport() {
  String json = "{";
  json += "\"firmware_version\":\"" FIRMWARE_VERSION "\",";
  json += "\"magic\":\"0x" + String(config.magic, HEX) + "\",";
  json += "\"ssid\":\"" + String(config.ssid) + "\",";
  json += "\"password\":\"" + String(config.password) + "\",";
  json += "\"timezone_offset\":" + String(config.timezone_offset) + ",";
  json += "\"dst_enabled\":" + String(config.dst_enabled ? "true" : "false") + ",";
  json += "\"brightness\":" + String(config.brightness) + ",";
  json += "\"ntp_server\":\"" + String(config.ntp_server) + "\",";
  json += "\"ntp_interval\":" + String(config.ntp_interval) + ",";
  json += "\"hour_format_24\":" + String(config.hour_format_24 ? "true" : "false") + ",";
  json += "\"hostname\":\"" + String(config.hostname) + "\",";
  json += "\"latitude\":" + String(config.latitude, 6) + ",";
  json += "\"longitude\":" + String(config.longitude, 6) + ",";
  json += "\"city_name\":\"" + String(config.city_name) + "\",";
  json += "\"weather_enabled\":" + String(config.weather_enabled ? "true" : "false") + ",";
  json += "\"weather_interval\":" + String(config.weather_interval) + ",";
  json += "\"display_rotation_sec\":" + String(config.display_rotation_sec) + ",";
  json += "\"show_weather\":" + String(config.show_weather ? "true" : "false") + ",";
  json += "\"show_sunrise_sunset\":" + String(config.show_sunrise_sunset ? "true" : "false") + ",";
  json += "\"display_orientation\":" + String(config.display_orientation) + ",";
  json += "\"night_mode_enabled\":" + String(config.night_mode_enabled ? "true" : "false") + ",";
  json += "\"night_start_hour\":" + String(config.night_start_hour) + ",";
  json += "\"night_start_minute\":" + String(config.night_start_minute) + ",";
  json += "\"night_end_hour\":" + String(config.night_end_hour) + ",";
  json += "\"night_end_minute\":" + String(config.night_end_minute) + ",";
  json += "\"admin_username\":\"" + String(config.admin_username) + "\",";
  json += "\"admin_password\":\"" + String(config.admin_password) + "\"";
  json += "}";

