Stibax/Arduino.esp8266-weather-clock-opensource/firmware/web_server.cpp
  server.sendHeader("Content-Disposition", "attachment; filename=clock-config.json");
  server.send(200, "application/json", json);
}

void ICACHE_FLASH_ATTR handleAPIConfigImport() {
  if (!server.hasArg("plain")) {
    server.send(400, "text/plain", "No config data received");
    return;
  }

  String body = server.arg("plain");
  Serial.println("Received config: " + body);

  // Parse various fields (simplified parsing)
  int pos;

  pos = body.indexOf("\"ssid\":\"");
  if (pos >= 0) {
    int start = pos + 8;
    int end = body.indexOf("\"", start);
    if (end > start) {
      safeStringCopy(body.substring(start, end), config.ssid, sizeof(config.ssid));
    }
  }

  pos = body.indexOf("\"password\":\"");
  if (pos >= 0) {
    int start = pos + 12;
    int end = body.indexOf("\"", start);
    if (end > start) {
      safeStringCopy(body.substring(start, end), config.password, sizeof(config.password));
    }
  }

  pos = body.indexOf("\"timezone_offset\":");
  if (pos >= 0) {
    int start = pos + 18;
    int end = body.indexOf(",", start);
    if (end < 0) end = body.indexOf("}", start);
    if (end > start) {
      config.timezone_offset = body.substring(start, end).toInt();
    }
  }

  pos = body.indexOf("\"brightness\":");
  if (pos >= 0) {
    int start = pos + 13;
    int end = body.indexOf(",", start);
    if (end < 0) end = body.indexOf("}", start);
    if (end > start) {
      config.brightness = body.substring(start, end).toInt();
    }
  }

  pos = body.indexOf("\"hostname\":\"");
  if (pos >= 0) {
    int start = pos + 12;
    int end = body.indexOf("\"", start);
    if (end > start) {
      safeStringCopy(body.substring(start, end), config.hostname, sizeof(config.hostname));
    }
  }

  pos = body.indexOf("\"city_name\":\"");
  if (pos >= 0) {
    int start = pos + 13;
    int end = body.indexOf("\"", start);
    if (end > start) {
      safeStringCopy(body.substring(start, end), config.city_name, sizeof(config.city_name));
    }
  }

  pos = body.indexOf("\"latitude\":");
  if (pos >= 0) {
    int start = pos + 11;
    int end = body.indexOf(",", start);
    if (end < 0) end = body.indexOf("}", start);
    if (end > start) {
      config.latitude = body.substring(start, end).toFloat();
    }
  }

  pos = body.indexOf("\"longitude\":");
  if (pos >= 0) {
    int start = pos + 12;
    int end = body.indexOf(",", start);
    if (end < 0) end = body.indexOf("}", start);
    if (end > start) {
      config.longitude = body.substring(start, end).toFloat();
    }
  }

  pos = body.indexOf("\"display_orientation\":");
  if (pos >= 0) {
    int start = pos + 22;
    int end = body.indexOf(",", start);
    if (end < 0) end = body.indexOf("}", start);
    if (end > start) {
      config.display_orientation = body.substring(start, end).toInt();
    }
  }

  pos = body.indexOf("\"show_weather\":");
  if (pos >= 0) {
    int start = pos + 16;
    int end = body.indexOf(",", start);
    if (end < 0) end = body.indexOf("}", start);
    if (end > start) {
      config.show_weather = (body.substring(start, end) == "true");
    }
  }

  pos = body.indexOf("\"show_sunrise_sunset\":");
  if (pos >= 0) {
    int start = pos + 23;
    int end = body.indexOf(",", start);
    if (end < 0) end = body.indexOf("}", start);
    if (end > start) {
      config.show_sunrise_sunset = (body.substring(start, end) == "true");
    }
  }

  pos = body.indexOf("\"night_mode_enabled\":");
  if (pos >= 0) {
    int start = pos + 21;
    int end = body.indexOf(",", start);
    if (end < 0) end = body.indexOf("}", start);
    if (end > start) {
      config.night_mode_enabled = (body.substring(start, end) == "true");
    }
  }

  pos = body.indexOf("\"night_start_hour\":");
  if (pos >= 0) {
    int start = pos + 19;
    int end = body.indexOf(",", start);
    if (end < 0) end = body.indexOf("}", start);
    if (end > start) {
      config.night_start_hour = body.substring(start, end).toInt();
    }
  }

  pos = body.indexOf("\"night_start_minute\":");
  if (pos >= 0) {
    int start = pos + 21;
    int end = body.indexOf(",", start);
    if (end < 0) end = body.indexOf("}", start);
    if (end > start) {
      config.night_start_minute = body.substring(start, end).toInt();
    }
  }

  pos = body.indexOf("\"night_end_hour\":");
  if (pos >= 0) {
    int start = pos + 17;
    int end = body.indexOf(",", start);
    if (end < 0) end = body.indexOf("}", start);
    if (end > start) {
      config.night_end_hour = body.substring(start, end).toInt();
    }
  }

  pos = body.indexOf("\"night_end_minute\":");
  if (pos >= 0) {
    int start = pos + 19;
    int end = body.indexOf(",", start);
    if (end < 0) end = body.indexOf("}", start);
    if (end > start) {
      config.night_end_minute = body.substring(start, end).toInt();
    }
  }

  pos = body.indexOf("\"admin_username\":\"");
  if (pos >= 0) {
    int start = pos + 19;
    int end = body.indexOf("\"", start);
    if (end > start) {
      safeStringCopy(body.substring(start, end), config.admin_username, sizeof(config.admin_username));
    }
  }

  pos = body.indexOf("\"admin_password\":\"");
  if (pos >= 0) {
    int start = pos + 19;
    int end = body.indexOf("\"", start);
    if (end > start) {
      safeStringCopy(body.substring(start, end), config.admin_password, sizeof(config.admin_password));
    }
  }

  config.night_start_hour = constrain(config.night_start_hour, 0, 23);
  config.night_start_minute = constrain(config.night_start_minute, 0, 59);
  config.night_end_hour = constrain(config.night_end_hour, 0, 23);
  config.night_end_minute = constrain(config.night_end_minute, 0, 59);

  config.magic = CONFIG_MAGIC;
  saveConfig();

  server.send(200, "application/json", "{\"status\":\"ok\",\"message\":\"Config imported and saved. Reboot recommended.\"}");
}

void ICACHE_FLASH_ATTR handleEEPROMClear() {
  EEPROM.begin(512);
  for (int i = 0; i < 512; i++) {
    EEPROM.write(i, 0xFF);
  }
  EEPROM.commit();
  EEPROM.end();

  Serial.println("EEPROM cleared!");

  server.send(200, "application/json", "{\"status\":\"ok\",\"message\":\"EEPROM cleared, device will reboot\"}");

  delay(1000);
  ESP.restart();
}

